app/controllers/appointments_controller.rb

SELECT "users".* FROM "users"
---
  def new
    @appointment = Appointment.new
    @username_array = User.all.map {|user| [user.firstname, user.lastname, user.id]}

INSERT INTO "appointments" ("date", "firstname", "lastname", "created_at", "updated_at", "specialty", "status") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save

UPDATE "appointments" SET "users_id" = ?, "status" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["users_id", 43], ["status", "Pending"], ["updated_at", 2016-12-04 03:54:42 -0500], ["id", 2]]
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 43], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."firstname" = ? LIMIT ?  [["firstname", "Doctor1"], ["LIMIT", 1]]
---
  def update
    respond_to do |format|
      if @appointment.update(appointment_params)
        format.html {redirect_to @appointment, notice: 'Appointment was successfully updated.' }
        format.json {head :no_content }
            if @appointment.update(status_params)

                if @appointment.status == "Confirm"

                    for i in  0..100 do
                        if @appointment.users_id == i
                          AppointmentMailer.confirm_appointment(User.find(i), @appointment.created_at, @appointment.status).deliver_now
                          Event.create(:users_id => current_user.id, :title => "Your have appointment with: " +  @appointment.firstname + " " +  @appointment.lastname, :start => @appointment.date, :end => @appointment.date+30.minutes, :color => "green")

SELECT "appointments".* FROM "appointments" WHERE "appointments"."status" = ?  [["status", "Pending"]]
---
  def check
   @appointments = Appointment.where(:status => "Pending")

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_appointment
      @appointment = Appointment.find(params[:id])