app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE ("events"."start" BETWEEN ? AND ?)  [["start", "2016-11-27"], ["start", "2017-01-08"]]
SELECT "events".* FROM "events" WHERE "events"."users_id" = ? AND "events"."users_id" IS NULL  [["users_id", 43]]
---
  def index
    if current_user.role == "office"
    @events = Event.where(start: params[:start]..params[:end])
    elsif current_user.role == "patient"
      @user_id = current_user.id
        @events = (Event.where(:users_id => @user_id) | Event.where(:users_id => nil ))

INSERT INTO "events" ("title", "start", "end", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    @event.save

UPDATE "events" SET "status" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["status", "Confirm"], ["updated_at", 2016-12-04 17:30:42 -0500], ["id", 8]]
SELECT "event_reminders".* FROM "event_reminders" WHERE "event_reminders"."events_id" = ?  [["events_id", 8]]
INSERT INTO "event_reminders" ("events_id", "users_id", "created_at", "updated_at", "status", "start", "end") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def update

      if @event.update(event_params)

        if @event.update(status_params)





          if (EventReminder.where(:events_id => @event.id).blank?) && (EventReminder.where(:users_id => current_user.id).blank?)
              EventReminder.create(:events_id => @event.id, :users_id => current_user.id, :status => "Confirm" , :start => @event.start, :end => @event.end)

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
  def destroy
    @event.destroy

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
    def set_event
      @event = Event.find(params[:id])