app/controllers/patients_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."specialty" = ?  [["specialty", "Allergy"]]
SELECT DISTINCT "appointments"."specialty" FROM "appointments" ORDER BY "appointments"."specialty" ASC
---
    def appointment
        @allergys = Appointment.where(:specialty => "Allergy")
        @backproblems = Appointment.where(:specialty => "BackProblems")

        @user_options = Appointment.order(:specialty).distinct.pluck(:specialty)

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_appointment
      @appointment = Appointment.find(params[:id])