app/controllers/users_controller.rb

     def patient_page
         @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("firstname", "lastname", "email", "created_at", "updated_at", "password_digest", "activation_digest", "role") VALUES (?, ?, ?, ?, ?, ?, ?, ?)