app/views/appointments/_form.html.erb

          <div class="controls">
            <%= f.collection_select :firstname, User.where(:role => "doctor"), :firstname, :firstname, prompt: 'Choose Doctor ' %>
---
SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", "doctor"]]