app/views/appointments/new.html.erb

SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", "doctor"]]
---
          <div class="controls">
            <%= f.collection_select :firstname, User.where(:role => "doctor"), :firstname, :firstname, prompt: 'Choose Doctor ' %>